Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you need more configuration properties, there is a full list at the end of this guide.
ja_jp: その他の設定プロパティーが必要な場合は、このガイドの最後に完全なリストがあります。

source: If you need more control on the written records, use `PulsarOutgoingMessageMetadata`.
ja_jp: 書き込まれたレコードをさらに制御する必要がある場合は、 `PulsarOutgoingMessageMetadata` を使用します。

source: If you need more control over the deployment configuration you can build the container image first and then configure the OpenShift application manually.
ja_jp: デプロイメント構成をより細かく制御する必要がある場合は、まずコンテナイメージをビルドしてから、OpenShiftアプリケーションを手動で構成することができます。

source: If you need more control over the deployment configuration, you can build the container image first and then configure the OpenShift application manually.
ja_jp: デプロイメント設定をより詳細に制御する必要がある場合は、最初にコンテナイメージをビルドし、OpenShift アプリケーションを手動で設定することができます。

source: If you need more control over the keystore used in a TLS configuration, you can provide a CDI bean implementing the `io.quarkus.tls.runtime.KeyStoreProvider` interface.
ja_jp: TLS 設定で使用されるキーストアをより詳細に制御する必要がある場合は、`io.quarkus.tls.runtime.KeyStoreProvider` インターフェイスを実装する CDI Bean を提供できます。

source: If you need more control over the keystore used in a TLS configuration, you can provide a CDI bean implementing the `io.quarkus.tls.runtime.KeyStoreProvider` interface. Quarkus calls `KeyStoreProvider::getKeyStore` when the TLS configuration is <<startup-checks,initially created>> and any time the configuration is <<reloading-certificates,reloaded>>. The resulting keystore and options are then made available via `TlsConfiguration::getKeyStore` and `TlsConfiguration::getKeyStoreOptions`.
ja_jp: TLS 設定で使用されるキーストアをより細かく制御する必要がある場合は、`io.quarkus.tls.runtime.KeyStoreProvider`インターフェイスを実装する CDI Bean を提供できます。Quarkus は TLS 設定が<<startup-checks,最初に作成される>> 場合、および設定が <<reloading-certificates,リロード>> されるたびに、`KeyStoreProvider::getKeyStore` を呼び出します。結果として得られるキーストアとオプションは、`TlsConfiguration::getKeyStore` と `TlsConfiguration::getKeyStoreOptions` を介して利用できるようになります。

source: If you need more control over the truststore used in a TLS configuration, you can provide a CDI bean implementing the `io.quarkus.tls.runtime.TrustStoreProvider` interface. Quarkus calls `TrustStoreProvider::getTrustStore` when the TLS configuration is <<startup-checks,initially created>> and any time the configuration is <<reloading-certificates,reloaded>>. The resulting truststore and options are then made available via `TlsConfiguration::getTrustStore` and `TlsConfiguration::getTrustStoreOptions`.
ja_jp: TLS 設定で使用されるトラストストアをより細かく制御する必要がある場合は、`io.quarkus.tls.runtime.TrustStoreProvider`インターフェイスを実装する CDI Bean を提供できます。Quarkus は TLS 設定が<<startup-checks,最初に作成される>> 場合、および設定が <<reloading-certificates,リロード>> されるたびに、`TrustStoreProvider::getTrustStore` を呼び出します。結果として得られるトラストストアとオプションは、`TlsConfiguration::getTrustStore` および `TlsConfiguration::getTrustStoreOptions` を介して利用できるようになります。

source: If you need more customization capabilities than registering a module, you can produce a CDI bean that implements `io.quarkus.jackson.ObjectMapperCustomizer` via an `AdditionalBeanBuildItem`. More info about customizing Jackson can be found on the JSON guide xref:rest-json.adoc#configuring-json-support[Configuring JSON support]
ja_jp: モジュールの登録よりも多くのカスタマイズ機能が必要な場合は、 `AdditionalBeanBuildItem` を介して `io.quarkus.jackson.ObjectMapperCustomizer` を実装する CDI Bean を作成できます。Jackson のカスタマイズの詳細については、JSON ガイドの xref:rest-json.adoc#configuring-json-support[ JSON サポートの設定] を参照してください。

source: If you need more customization capabilities than registering a module, you can produce a CDI bean that implements `io.quarkus.jackson.ObjectMapperCustomizer` via an `AdditionalBeanBuildItem`. More info about customizing Jackson can be found on the JSON guide xref:rest-json.adoc#json[Configuring JSON support]
ja_jp: モジュールの登録よりも多くのカスタマイズ機能が必要な場合は、 `AdditionalBeanBuildItem` を介して `io.quarkus.jackson.ObjectMapperCustomizer` を実装する CDI Bean を作成できます。 Jackson のカスタマイズの詳細については、JSON ガイドの xref:rest-json.adoc#json[JSON サポートの設定] を参照してください。

source: If you need more customization capabilities than registering a serializer or a deserializer, you can produce a CDI bean that implements `io.quarkus.jsonb.JsonbConfigCustomizer` via an `AdditionalBeanBuildItem`. More info about customizing JSON-B can be found on the JSON guide xref:rest-json.adoc#configuring-json-support[Configuring JSON support]
ja_jp: シリアライザーまたは弟子リアライザーの登録よりも多くのカスタマイズ機能が必要な場合は、 `AdditionalBeanBuildItem` を介して `io.quarkus.jsonb.JsonbConfigCustomizer` を実装する CDI Bean を作成できます。JSON-B のカスタマイズの詳細については、JSON ガイドの xref:rest-json.adoc#configuring-json-support[JSON サポートの設定] を参照してください。

source: If you need more customization capabilities than registering a serializer or a deserializer, you can produce a CDI bean that implements `io.quarkus.jsonb.JsonbConfigCustomizer` via an `AdditionalBeanBuildItem`. More info about customizing JSON-B can be found on the JSON guide xref:rest-json.adoc#json[Configuring JSON support]
ja_jp: シリアライザーまたはデシリアライザーの登録よりも多くのカスタマイズ機能が必要な場合は、 `AdditionalBeanBuildItem` を介して `io.quarkus.jsonb.JsonbConfigCustomizer` を実装する CDI Bean を作成できます。 JSON-B のカスタマイズの詳細については、JSON ガイドの xref:rest-json.adoc#json[JSON サポートの設定] を参照してください。

source: If you need multiple (shared) Data Index instances, you can configure the `quarkus.kogito.devservices.service-name` attribute and indicate the instance name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `kogito-data-index`.
ja_jp: 複数の（共有）Data Indexインスタンスが必要な場合は、 `quarkus.kogito.devservices.service-name` 属性を設定し、インスタンス名を示します。同じ値のコンテナを探し、見つからない場合は新しいコンテナを開始します。デフォルトのサービス名は `kogito-data-index` です。

source: If you need multiple (shared) Infinispan server, you can configure the `quarkus.infinispan-client.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `infinispan`.
ja_jp: 複数の（共有）Infinispanサーバーが必要な場合は、 `quarkus.infinispan-client.devservices.service-name` 属性を設定して、サーバー名を指定することが可能です。 同じ値を持つコンテナを探すか、見つからない場合は新しいコンテナを起動します。 デフォルトのサービス名は `infinispan` です。

source: If you need multiple (shared) brokers, you can configure the `quarkus.amqp.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `amqp`.
ja_jp: 複数の（共有）ブローカーが必要な場合は、 `quarkus.amqp.devservices.service-name` 属性を設定し、ブローカー名を示します。同じ値のコンテナを探し、見つからない場合は新しいコンテナを開始します。デフォルトのサービス名は `amqp` です。

source: If you need multiple (shared) brokers, you can configure the `quarkus.kafka.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `kafka`.
ja_jp: 複数の（共有）ブローカーが必要な場合は、 `quarkus.kafka.devservices.service-name` 属性を設定し、ブローカー名を示します。同じ値のコンテナを探し、見つからない場合は新しいコンテナを開始します。デフォルトのサービス名は `kafka` です。

source: If you need multiple (shared) brokers, you can configure the `quarkus.pulsar.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `pulsar`.
ja_jp: 複数の (共有) ブローカーが必要な場合は、`quarkus.pulsar.devservices.service-name` 属性を設定してブローカー名を指定できます。 値が同じコンテナーを検索し、見つからない場合は新しいコンテナーを開始します。 デフォルトのサービス名は `pulsar` です。

source: If you need multiple (shared) brokers, you can configure the `quarkus.rabbitmq.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `rabbitmq`.
ja_jp: 複数の（共有）ブローカーが必要な場合は、 `quarkus.rabbitmq.devservices.service-name` 属性を設定し、ブローカー名を示します。同じ値のコンテナを探し、見つからない場合は新しいコンテナを開始します。デフォルトのサービス名は `rabbitmq` です。

source: If you need multiple (shared) clusters, you can configure the `quarkus.kubernetes-client.devservices.service-name` configuration property and indicate the cluster name. It looks for a container with the name defined, or starts a new one if none can be found. The default service name is `kubernetes`.
ja_jp: 複数の（共有）クラスターが必要な場合は、 `quarkus.kubernetes-client.devservices.service-name` 設定プロパティを構成して、クラスター名を指定します。定義された名前のコンテナを検索し、見つからない場合は新しいコンテナを起動します。デフォルトのサービス名は `kubernetes` です。

source: If you need multiple (shared) clusters, you can provide a value for the `quarkus.kubernetes-client.devservices.service-name` configuration property to specify the name of the cluster that will be shared among the selected applications. The dev service support will look for an already existing container with that specified name or starts a new one if none can be found.The default service name is `kubernetes`.
ja_jp: 複数の（共有）クラスターが必要な場合は、`quarkus.kubernetes-client.devservices.service-name` 設定プロパティーに値を指定して、選択したアプリケーション間で共有されるクラスターの名前を指定できます。dev service サポートは、指定された名前の既存のコンテナーを探し、見つからない場合は新しいコンテナーを起動します。デフォルトのサービス名は `kubernetes` です。

source: If you need multiple (shared) coordinators, you can configure the `quarkus.lra.devservices.service-name` attribute and indicate the coordinator name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `lra-coordinator`.
ja_jp: 複数の（共有）コーディネーターが必要な場合は、`quarkus.lra.devservices.service-name` 属性を設定し、コーディネーター名を指定できます。同じ値を持つコンテナーを探し、見つからない場合は新しいコンテナーを起動します。デフォルトのサービス名は `lra-coordinator` です。

source: If you need multiple (shared) registries, you can configure the `quarkus.apicurio-registry.devservices.service-name` attribute and indicate the registry name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `apicurio-registry`.
ja_jp: 複数の（共有）レジストリが必要な場合は、 `quarkus.apicurio-registry.devservices.service-name` 属性を設定し、レジストリ名を示すことができます。同じ値のコンテナを探し、見つからない場合は新しいコンテナを開始します。デフォルトのサービス名は `apicurio-registry` です。

source: If you need multiple (shared) servers, you can configure the `quarkus.elasticsearch.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `elasticsearch`.
ja_jp: 複数の（共有）サーバーが必要な場合は、 `quarkus.elasticsearch.devservices.service-name` 属性を設定し、サーバー名を指定することができます。同じ値を持つコンテナを探すか、見つからない場合は新規に起動します。デフォルトのサービス名は `elasticsearch` です。

source: If you need multiple (shared) servers, you can configure the `quarkus.infinispan-client.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `infinispan`.
ja_jp: 複数の（共有）サーバーが必要な場合は、 `quarkus.infinispan-client.devservices.service-name` 属性を設定し、サーバー名を指定することができます。同じ値を持つコンテナを探し、見つからない場合は新しいコンテナを起動します。デフォルトのサービス名は、 `infinispan` です。

source: If you need multiple (shared) servers, you can configure the `quarkus.mongodb.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `mongodb`.
ja_jp: 複数の（共有）サーバーが必要な場合は、 `quarkus.mongodb.devservices.service-name` 属性を設定し、サーバー名を指定します。 同じ値を持つコンテナを探すか、見つからない場合は新しいコンテナを起動します。デフォルトのサービス名は `mongodb` です。

source: If you need multiple (shared) servers, you can configure the `quarkus.redis.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `redis`.
ja_jp: 複数の（共有）サーバーが必要な場合は、 `quarkus.redis.devservices.service-name` 属性を設定し、サーバー名を示します。同じ値を持つコンテナを探し、見つからない場合は新しいコンテナを開始します。デフォルトのサービス名は `redis` です。

source: If you need that your spans and logs to be exported directly as they finish (e.g. in a serverless environment / application), you can set this property to `true`. This replaces the default batching of data.
ja_jp: スパンやログを終了時に直接エクスポートする必要がある場合（サーバーレス環境/アプリケーションなど）、このプロパティを `true` に設定できます。 これは、データのデフォルトのバッチ処理を置き換えます。

source: If you need the MySQL Connector/J OpenTelemetry integration, enable it explicitly by setting `quarkus.datasource.jdbc.additional-jdbc-properties.openTelemetry=PREFERRED`. For more information, see link:https://dev.mysql.com/doc/connector-j/en/connector-j-connp-props-debugging-profiling.html#cj-conn-prop_openTelemetry[MySQL Connector/J documentation].
ja_jp: MySQL Connector/J の OpenTelemetry インテグレーションが必要な場合は、 `quarkus.datasource.jdbc.additional-jdbc-properties.openTelemetry=PREFERRED` を設定して明示的に有効にしてください。詳細は link:https://dev.mysql.com/doc/connector-j/en/connector-j-connp-props-debugging-profiling.html#cj-conn-prop_openTelemetry[MySQL Connector/J ドキュメント] を参照してください。

source: If you need to access JWT token claims then you can inject `JsonWebToken`:
ja_jp: JWT トークンクレームにアクセスする必要がある場合は、 `JsonWebToken` を注入できます。

source: If you need to access JWT token claims, you can inject `JsonWebToken`:
ja_jp: JWT トークンクレームにアクセスする必要がある場合は、 `JsonWebToken` を注入できます。

source: If you need to access the CSRF cookie from JavaScript in order to pass its value as a header, use `{inject:csrf.cookieName}` and `{inject:csrf.headerName}` to inject the cookie name which has to be read as a CSRF header value and allow accessing this cookie:
ja_jp: CSRF クッキーの値をヘッダとして渡すために、JavaScript から CSRF クッキーにアクセスする必要がある場合、 `{inject:csrf.cookieName}` と `{inject:csrf.headerName}` を使って、CSRF ヘッダ値として読まれなければならないクッキー名を注入し、このクッキーへのアクセスを許可してください：

source: If you need to acquire an access token and have posted an existing refresh token to the current Quarkus endpoint, you must use the `refresh_token` grant. This grant uses an out-of-band refresh token to obtain a new token set.
ja_jp: アクセストークンを取得する必要があり、既存のリフレッシュトークンを現在の Quarkus エンドポイントにポストしている場合は、 `refresh_token` グラントを使用する必要があります。このグラントは、アウトオブバンドのリフレッシュトークンを使用して新しいトークンセットを取得します。

source: If you need to acquire an access token and have posted an existing refresh token to the current Quarkus endpoint, you must use the `refresh_token` grant. This grant employs an out-of-band refresh token to obtain a new token set. In this case, configure `OidcClient` as follows:
ja_jp: アクセストークンを取得する必要があり、既存のリフレッシュトークンを現在の Quarkus エンドポイントに POST している場合は、 `refresh_token` グラントを使用する必要があります。このグラントでは、帯域外のリフレッシュトークンを使用して新しいトークンセットを取得します。 この場合、 `OidcClient` を次のように設定します。

source: If you need to add an authorization header, or any other custom HTTP header (in our case it's not required), this can be done by:
ja_jp: 認証ヘッダやその他のカスタムHTTPヘッダ（ここでは必須ではありません）を追加する必要がある場合は、以下の方法で行います。

source: If you need to add an authorization header, or any other custom HTTP header (in our case it's not required), this can be done with a configuration in the configuration file as well:
ja_jp: authorizationヘッダやその他のカスタムHTTPヘッダを追加する必要がある場合（私たちのケースでは必須ではありません）、これも設定ファイルのコンフィギュレーションで行うことができます：

source: If you need to authenticate and authorize the users using OpenID Connect Authorization Code Flow, see xref:security-oidc-code-flow-authentication.adoc[OIDC code flow mechanism for protecting web applications]. Also, if you use Keycloak and bearer tokens, see xref:security-keycloak-authorization.adoc[Using Keycloak to Centralize Authorization].
ja_jp: OpenID Connect認可コードフローを使用してユーザーを認証および認可する必要がある場合は、 xref:security-oidc-code-flow-authentication.adoc[Webアプリケーションを保護するためのOIDCコードフロー] メカニズムを参照してください。また、Keycloakとベアラートークンを使用する場合は、 xref:security-keycloak-authorization.adoc[Keycloakを使用して認証を一元化] するを参照してください。

source: If you need to authenticate and authorize the users using OpenID Connect Authorization Code Flow, see xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Applications]. Also, if you use Keycloak and Bearer Tokens, see xref:security-keycloak-authorization.adoc[Using Keycloak to Centralize Authorization].
ja_jp: OpenID Connect認可コードフローを使用してユーザーの認証と認可を行う必要がある場合は、 link:security-openid-connect-web-authentication.html[Using OpenID Connect to Protect Web Applications] を参照してください。また、KeycloakとBearer Tokenを使用する場合は、 link:security-keycloak-authorization.html[Using Keycloak to Centralize Authorization] を参照してください。

source: If you need to authenticate and authorize users by using OIDC authorization code flow, see the Quarkus xref:security-oidc-code-flow-authentication.adoc[OpenID Connect authorization code flow mechanism for protecting web applications] guide. Also, if you use Keycloak and bearer tokens, see the Quarkus xref:security-keycloak-authorization.adoc[Using Keycloak to centralize authorization] guide.
ja_jp: OIDC 認可コードフローを使用してユーザーを認証および認可する必要がある場合は、Quarkus の xref:security-oidc-code-flow-authentication.adoc[Web アプリケーションを保護するための OpenID Connect 認可コードフローメカニズム] ガイドを参照してください。 また、Keycloak とベアラートークンを使用する場合は、Quarkus xref:security-keycloak-authorization.adoc[Keycloak を使用した認可の一元化] ガイドを参照してください。

source: If you need to change any of the default property values, here is an example on how to configure the default OTLP gRPC Exporter within the application, using the `src/main/resources/application.properties` file:
ja_jp: デフォルトのプロパティ値を変更する必要がある場合、 `src/main/resources/application.properties` ファイルを使用して、アプリケーション内でデフォルトの OTLP gRPC Exporter を設定する方法の例を以下に示します:

source: If you need to configure Keycloak programmatically then consider using https://www.keycloak.org/docs/latest/server_development/#admin-rest-api[Keycloak Admin REST API] with the help of the `quarkus-keycloak-admin-client` extension.
ja_jp: Keycloakをプログラムで設定する必要がある場合は、 `quarkus-keycloak-admin-client` エクステンションの助けを借りて、 link:https://www.keycloak.org/docs/latest/server_development/#admin-rest-api[Keycloak Admin REST API]の使用を検討してください。

source: If you need to configure a deadline for a gRPC stub, i.e. to specify a duration of time after which the stub will always return the status error `DEADLINE_EXCEEDED`. You can specify the deadline via the `quarkus.grpc.clients."service-name".deadline` configuration property, e.g.:
ja_jp: gRPCスタブにデッドラインを設定する必要がある場合、つまり、以後、スタブが常にステータスエラー `DEADLINE_EXCEEDED` を返すようになる期間を指定する必要がある場合、デッドラインは、 `quarkus.grpc.clients."service-name".deadline` の設定プロパティで指定することができます。例:

source: If you need to configure the `argLine` property of the Surefire plugin (e.g. for setting memory parameters), you need to use https://maven.apache.org/surefire/maven-surefire-plugin/faq.html#late-property-evaluation[Maven late property evaluation^], otherwise the Jacoco agent will not be correctly added, and regular JUnit tests and Quarkus `ComponentTest` will not get covered. Example: `<argLine>@{argLine} -your -extra -arguments</argLine>`.
ja_jp: Surefireプラグインの `argLine` プロパティ（メモリパラメータの設定など）を設定する必要がある場合、 link:https://maven.apache.org/surefire/maven-surefire-plugin/faq.html#late-property-evaluation[Mavenの後期プロパティ評価] を使用する必要があります。そうしないと、Jacocoエージェントが正しく追加されず、通常のJUnitテストとQuarkus `ComponentTest` がカバーされません。例: `<argLine>@{argLine} -your -extra -arguments</argLine>` .

source: If you need to connect to a database for which Quarkus does not provide an extension with the JDBC driver, you can use a custom driver instead. For example, if you are using the OpenTracing JDBC driver in your project.
ja_jp: QuarkusがJDBCドライバーでエクステンションを提供していないデータベースに接続する必要がある場合、代わりにカスタムドライバーを使用できます。 たとえば、プロジェクトでOpenTracing JDBCドライバを使用している場合です。

source: If you need to create spans manually within a mutiny pipeline, use `wrapWithSpan` method from `io.quarkus.opentelemetry.runtime.tracing.mutiny.MutinyTracingHelper`.
ja_jp: mutiny パイプライン内でスパンを手動で作成する必要がある場合は、 `io.quarkus.opentelemetry.runtime.tracing.mutiny.MutinyTracingHelper` の `wrapWithSpan` メソッドを使用してください。

source: If you need to customize the Mongo client configuration programmatically, you need to implement the `io.quarkus.mongodb.runtime.MongoClientCustomizer` interface and expose it as a CDI _application scoped_ bean:
ja_jp: Mongo クライアント設定をプログラムでカスタマイズする必要がある場合は、 `io.quarkus.mongodb.runtime.MongoClientCustomizer` インターフェイスを実装し、それを CDI _アプリケーションスコープ_ Bean として公開する必要があります。

source: If you need to customize the compiler flags used by `kotlinc` in development mode, you can configure them in the quarkus plugin:
ja_jp: 開発モードで `kotlinc` によって使用されるコンパイラ フラグをカスタマイズする必要がある場合は、それらを quarkus プラグインで設定できます。

source: If you need to customize the compiler flags used by the plugin (for instance in <<dev-mode,development mode>>), add a `configuration` section to the `plugin` block and set the `compilerArgs` property just as you would when configuring `maven-compiler-plugin`. You can also set `source`, `target`, and `jvmArgs`. For example, to pass `--enable-preview` to both the JVM and `javac`:
ja_jp: プラグインによって使用されるコンパイラ・フラグをカスタマイズする必要がある場合は（例えば<<dev-mode,開発モード>>）、 `plugin` ブロックに `configuration` セクションを追加し、 `maven-compiler-plugin` を設定するときと同じように `compilerArgs` プロパティーを設定します。また、 `source` 、 `target` 、および `jvmArgs` を設定することもできます。例えば、 `--enable-preview` を JVM と `javac` の両方に渡すには次のように設定します:

source: If you need to customize the compiler flags used by the plugin, like in <<dev-mode,development mode>>, add a `configuration` section to the `plugin` block and set the `compilerArgs` property just as you would when configuring `maven-compiler-plugin`. You can also set `source`, `target`, and `jvmArgs`. For example, to pass `--enable-preview` to both the JVM and `javac`:
ja_jp: xref:dev-mode[開発モード] のように、プラグインが使用するコンパイラフラグをカスタマイズする必要がある場合は、 `plugin` ブロックに `configuration` セクションを追加し、 `maven-compiler-plugin` を設定するときと同じように `compilerArgs` プロパティを設定します。 `source` , `target` , `jvmArgs` を設定することもできます。 たとえば、 `--enable-preview` を JVM と `javac` の両方に渡す場合、次のように行います：

source: If you need to customize the compiler flags used by the plugin, like in xref:dev-mode[development mode], add a `configuration` section to the `plugin` block and set the `compilerArgs` property just as you would when configuring `maven-compiler-plugin`. You can also set `source`, `target`, and `jvmArgs`. For example, to pass `--enable-preview` to both the JVM and `javac`:
ja_jp: xref:dev-mode[開発モード] のように、プラグインが使用するコンパイラフラグをカスタマイズする必要がある場合は、 `plugin` ブロックに `configuration` セクションを追加し、 `maven-compiler-plugin` を設定するときと同じように `compilerArgs` プロパティを設定します。また、 `source` 、 `target` 、 `jvmArgs` を設定することができます。たとえば、 `--enable-preview` を JVM と `javac` の両方に渡す場合:

source: If you need to customize the compiler flags used in development mode, add a `configuration` section to the `plugin` block and set the `compilerArgs` property just as you would when configuring `maven-compiler-plugin`. You can also set `source`, `target`, and `jvmArgs`. For example, to pass `--enable-preview` to both the JVM and `javac`:
ja_jp: 開発モードで使用するコンパイラ・フラグをカスタマイズする必要がある場合は、 `plugin` ブロックに `configuration` セクションを追加し、 `maven-compiler-plugin` を設定するときと同じように `compilerArgs` プロパティーを設定します。また、 `source` 、 `target` 、および `jvmArgs` を設定することもできます。例えば、 `--enable-preview` を JVM と `javac` の両方に渡すには、 を設定します。

source: If you need to delay the initialization of a class, you can use the `--initialize-at-run-time=<package or class>` configuration knob.
ja_jp: クラスの初期化を遅らせる必要がある場合は、 `--initialize-at-run-time=<package or class>` 設定ノブを使用します。

source: If you need to do some integration testing against Keycloak then you are encouraged to do it with <<integration-testing-keycloak-devservices,Dev Services For Keycloak>>. Use `KeycloakTestResourceLifecycleManager` for your tests only if there is a good reason not to use `Dev Services for Keycloak`.
ja_jp: Keycloak に対して統合テストを行う必要がある場合は、<<integration-testing-keycloak-devservices,Dev Services For Keycloak>> で行うことをお勧めします。 `Dev Services for Keycloak` を使用しない正当な理由がある場合にのみ、テストに `KeycloakTestResourceLifecycleManager` を使用してください。
